
&НаКлиенте
Процедура РассчетСуммыТЧ()
	
	Товары = Элементы.Товары.ТекущиеДанные;
	ДатаДокумента = ЭтаФорма.Элементы.Дата.ВыделенныйТекст;
	Если ДатаДокумента = Дата(1, 1, 1) Тогда
		Сообщить("Пустая дата!");
	КонецЕсли;
	МассивДанных = ПолучитьДанныеДляФормыНаСервере(ДатаДокумента);
	Если МассивДанных.Количество()>1 Тогда
		Сообщить("Указано более 2 ставок НДС, обратитесь к администратору");
	Иначе
		Товары.НДС = МассивДанных[0].Ставка;
	КонецЕсли;
	Товары.СуммаБезНДС = Товары.Количество * Товары.Цена;
	Товары.ИтогоНДС = (Товары.СуммаБезНДС/100)*Товары.НДС;
	Товары.СуммаСНДС = Товары.СуммаБезНДС + Товары.ИтогоНДС;
	
КонецПроцедуры // РассчетСуммыТЧ()


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	РассчетСуммыТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчетСуммыТЧ();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляФормыНаСервере(ДатаДокумента)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДС.Наименование КАК Наименование,
	|	СтавкиНДС.СтавкаНДС КАК СтавкаНДС,
	|	СтавкиНДС.НачалоДействияСтавкиНДС КАК НачалоДействияСтавкиНДС,
	|	СтавкиНДС.ОкончаниеДейстствияСтавкиНДС КАК ОкончаниеДейстствияСтавкиНДС
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	&ДатаДокумента МЕЖДУ СтавкиНДС.НачалоДействияСтавкиНДС И СтавкиНДС.ОкончаниеДейстствияСтавкиНДС";
	Запрос.УстановитьПараметр("ДатаДокумента",ДАТА(ДатаДокумента));
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивСтруктур = Новый Массив;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Наименование",ВыборкаДетальныеЗаписи.Наименование);
		СтруктураДанных.Вставить("Ставка",ВыборкаДетальныеЗаписи.СтавкаНДС);
		СтруктураДанных.Вставить("ДатаНачалаСтавки",ВыборкаДетальныеЗаписи.НачалоДействияСтавкиНДС);
		СтруктураДанных.Вставить("ДатаНачалаСтавки",ВыборкаДетальныеЗаписи.ОкончаниеДейстствияСтавкиНДС);
		МассивСтруктур.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат МассивСтруктур;
КонецФункции // ЗаполнениеНДС()

