Процедура  ПередЗаписью(отказ)
	
	Для Позиция = 1	По СтрДлина(Телефон) Цикл
		
		СимволТелефона = Сред(Телефон,Позиция,1);
		
		Если СтрНайти("0123456789 +-()",СимволТелефона)=0 Тогда
			Отказ = Истина;
			ВызватьИсключение "Телефон может содержать только цифры, пробелы и символы +,-,(, ) символ: ( "+СимволТелефона+" ) нельзя указать для номера.";
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПроверкаЭлектронногоАдреса(ЭлектроннаяПочта) Тогда
		Отказ = Истина;
		Сообщить("Некорректный адрес, пропущен знак ( @ )");
	КонецЕсли;
	
Конецпроцедуры